#include <iostream>
using namespace std;
int main(){
    float F , C;
    cout << "Enter F:" ; cin >> F;
     /*ต้องทำให้ 5 เป็นทศนิยมก่อน หรือ
     C = ( (float)5 / 9) * (F - 32);
     literal = การกำหนดค่าคงที่
     calibrate = ปรับค่าให้ตรง */
    C = (5.0 / 9) * (F - 32);
    cout << "F = " << F << endl;
    cout << "C = " << C << endl;
    F = ((9.0 / 5) * C) + 32;
    cout << "C = " << C << endl;
    cout << "F = " << F << endl;
    
    return 0;
    /* ยอมรับความคลาดเคลื่อนได้เพราะ  คลาดเคลื่อนนิดเดียว อาจมีการเปลี่ยนแปลงระหว่างทาง
    ในสอบควร track ทีละค่าว่าถูกไหม 
     0 ในทางคณิตศาสตร์ มีค่าไมาใชาไม่มีค่า มี ทศนิยมนิดเดียวติดอยู่ด้วย*/
}